/*
    자바스크립트
    - 객체 기반의 스크립트 프로그래밍 언어
    - 초기엔 웹브라우저에서만 실행
    - Node JS를 이용해서 콘솔창 환경에서도 사용가능
    - 자바와 문법이 유사 ( C언어 기반이기 때문이라...)
    - 초기에는 웹의 UI를 제어하기 위해서 만들어짐...


    자바스크립트 엔진
    - 자바스크립트 명령어를 읽어서 실행시키는 프로그램
    - 브라우저마다 자신의 자바스크립트 엔진이 탑재되어 있다.
    - 크롬의 V8엔진 (빠르다.) Node JS 가 V8엔진 기반이다
    - 인터넷 엣지 차크라 엔진, 사파리 니트로라는 엔진 파이어폭스 스파이더 몽키 엔진

    자바스크립트를 브라우저에서 사용할 경우
    -<script></script> 태그를 사용
    -<script> 태그는 문서내의 위치 제약을 받지 않는다.
    -권장하는 위치는 body가 끝나기 전 또는 head 태그가 끝나기 전..
*/
console.log("스크립트 파일 내용 실행");
