/*
     컴파일러는 전체를 모두 변환하여 실행합니다. 
     하지만 인터프리터의 경우 한 줄 단위로 변환 및 실행을 반복합니다.
     자바스크립트는 인터프리터 언어

    자바스크립트 변수6

    변수의 호이스팅  (Hoisting)
    변수를 컴파일할때 끌어 올리는 것.

    - 자바스크립트 엔진이 스크립트를 해석하는 단계
    - 컴파일과 실행
     1. 컴파일시에 변수에 대한 정보를 먼저 설정한다.
     2. 그다음 실행한다.
*/

"use strict"
var id = "hong";
console.log(id);

var id = "kim";
console.log(id);

var name;
console.log(name);

/*
    컴파일 단계 
    -변수들에 대한 정보를 미리다 로딩한다.
    -------------------------------------
    var id; 
    var name; 
    -------------------------------------
    실행단계
    -------------------------------------
    id = "hong"; 
    console.log(id); 

    id = "kim"; 
    console.log(id); 
    
    console.log(name);
    -------------------------------------

*/